eval "$(ssh-agent -s)"

my_list = [2, 4, 2, 5, 5, 7, 8]
d = {'salary': 100, 'bonus': 25, 'extra': 50}

#1.Вивести суму усіх елементів списку (a)
print(sum(my_list))

#2. Вивести суму усіх УНІКАЛЬНИХ елементів списку (a)
my_set = set(my_list)
print(sum(my_set))New


#3.Надрукувати суму елемента 3 зі списку (а), та зарплати зі словника (б)


#4.Надрукувати повну суму доходу на основі словника (б)
print(sum(d.values()))

# 5.Перевизначити зарплату в словнику, збільшивши її на суму премії та надрукувати результат

d ['salary'] = (d ['salary'] + d['extra'])
print(d)







